{
    "version": "https://jsonfeed.org/version/1",
    "title": "sahebansari.com",
    "description": "",
    "home_page_url": "https://www.sahebansari.com",
    "feed_url": "https://www.sahebansari.com/feed.json",
    "user_comment": "",
    "icon": "https://www.sahebansari.com/media/website/logo-transparent-svg-2.svg",
    "author": {
        "name": "Saheb Ansari"
    },
    "items": [
        {
            "id": "https://www.sahebansari.com/ai-the-new-best-friend-you-never-knew-you-needed.html",
            "url": "https://www.sahebansari.com/ai-the-new-best-friend-you-never-knew-you-needed.html",
            "title": "AI: The New Best Friend You Never Knew You Needed",
            "summary": "Hey there, future-dweller! So, you’ve heard about Artificial Intelligence (AI), right? It’s that fancy buzzword everyone’s been throwing around like it’s the new avocado toast. But what’s all the fuss about, really? Let’s dive into why AI is not just another fad, but actually your&hellip;",
            "content_html": "<p><strong>Hey there, future-dweller!</strong></p>\n<p>So, you’ve heard about Artificial Intelligence (AI), right? It’s that fancy buzzword everyone’s been throwing around like it’s the new avocado toast. But what’s all the fuss about, really? Let’s dive into why AI is not just another fad, but actually your future BFF (Best Friend Forever).</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://www.sahebansari.com/media/posts/3/playfull-ai-2.png\" alt=\"\" width=\"400\" height=\"400\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://www.sahebansari.com/media/posts/3/responsive/playfull-ai-2-xs.png 640w ,https://www.sahebansari.com/media/posts/3/responsive/playfull-ai-2-sm.png 768w ,https://www.sahebansari.com/media/posts/3/responsive/playfull-ai-2-md.png 1024w ,https://www.sahebansari.com/media/posts/3/responsive/playfull-ai-2-lg.png 1366w ,https://www.sahebansari.com/media/posts/3/responsive/playfull-ai-2-xl.png 1600w ,https://www.sahebansari.com/media/posts/3/responsive/playfull-ai-2-2xl.png 1920w\"></figure>\n<h3><strong>The AI Hype Train: All Aboard!</strong></h3>\n<p>Remember when smartphones were new and we couldn’t stop poking at screens? Well, AI is like that, but on digital steroids. It’s already driving cars, diagnosing diseases, and yes, even helping you choose the next binge-worthy show on Netflix. Imagine having a personal assistant who never sleeps, never gets grumpy, and actually loves organizing your life. Sounds dreamy, right?</p>\n<h3><strong>AI at Home: Not Just for Sci-Fi Movies</strong></h3>\n<p>Picture this: You wake up to the smell of freshly brewed coffee, thanks to your AI-powered coffee maker. Your AI butler, let’s call him “Jarvis” (because why not), has already adjusted the room temperature to your liking and played your favorite morning jam. And the best part? You didn’t have to lift a finger.</p>\n<p>Oh, and let’s not forget the AI vacuum cleaner that’s not just sucking up dust but also your existential dread of cleaning.</p>\n<h3><strong>Work: The AI Co-Worker Who’s Never Late</strong></h3>\n<p>Say goodbye to the days of stressing over spreadsheets. Your new AI co-worker handles data entry faster than you can say “Ctrl+C, Ctrl+V.” It’s like having an office buddy who doesn’t steal your lunch from the fridge. Plus, AI can help you brainstorm, draft emails, and even schedule meetings – all while you get to focus on the fun stuff, like coming up with the next big idea (or just sipping coffee in peace).</p>\n<h3><strong>AI in Healthcare: Because Dr. Google Needs an Upgrade</strong></h3>\n<p>We’ve all been there: a quick search about a headache on Google, and suddenly you’re convinced you have a rare tropical disease. With AI, you can actually get accurate health insights without the unnecessary panic. AI systems can analyze medical data, predict potential health issues, and even assist in surgeries. It’s like having a doctor who’s always on call and never prescribes you WebMD-induced anxiety.</p>\n<h3><strong>The Future: AI’s Crystal Ball</strong></h3>\n<p>Now, let’s peek into the future. AI could be the driving force behind flying cars, smart cities, and maybe even those cool hologram calls we’ve been promised since forever. Imagine a world where traffic jams are a thing of the past because AI manages the roads, or where your fridge restocks itself because it knows you’ve run out of milk. It’s not just sci-fi anymore; it’s the future we’re speeding towards.</p>\n<h3><strong>But Wait, There’s More: The Fun Stuff!</strong></h3>\n<p>Ever wished you had more time to binge-watch cat videos or scroll through memes? With AI taking over the mundane tasks, you’ll have more free time for the important things in life. Plus, AI can even help you discover new hobbies or connect with people who share your quirky interests.</p>\n<p>So, there you have it – AI isn’t just about robots and algorithms; it’s about making life easier, more fun, and a whole lot smarter. Embrace the AI revolution, and who knows, you might just find your new best friend in a machine.</p>\n<p>Until next time, keep calm and let AI handle it!</p>\n<div> </div>\n<p>I hope you enjoyed that light-hearted take on the future of AI! What do you think?</p>\n<p><br><br></p>",
            "image": "https://www.sahebansari.com/media/posts/3/playfull-ai.png",
            "author": {
                "name": "Saheb Ansari"
            },
            "tags": [
                   "Technology",
                   "AI"
            ],
            "date_published": "2024-11-10T12:59:27+05:30",
            "date_modified": "2024-11-10T12:59:27+05:30"
        },
        {
            "id": "https://www.sahebansari.com/secure-web-api-by-using-latest-tls-version.html",
            "url": "https://www.sahebansari.com/secure-web-api-by-using-latest-tls-version.html",
            "title": "Are you TLS 1.2 ready? Force your secure Web API to use TLS 1.2",
            "summary": "What is TLS? Transport Layer Security (TLS) is an industry security standard to help protect data transmitted over the internet. The newest version of TLS, 1.2 provides enhanced security and it is the current standard. .NET Framework &amp; TLS The .NET framework uses common language&hellip;",
            "content_html": "<p class=\"align-left\"><strong>What is TLS?</strong><br>Transport Layer Security (TLS) is an industry security standard to help protect data transmitted over the internet. The newest version of TLS, 1.2 provides enhanced security and it is the current standard.<br><br><strong>.NET Framework &amp; TLS </strong><br>The .NET framework uses common language runtime, used as an execution engine and class library providing reusable code. Older versions of .NET do not support the newer TLS 1.2 so it is recommended to also upgrade .NET to at least 4.5 if you are using an older version of Windows. The .NET 4.5 supports TLS 1.2 but it is not the default protocol so you need to opt-in to use the latest TLS 1.2.</p>\n<figure class=\"post__image post__image--center\"><br><img loading=\"lazy\"  style=\"outline: 3px solid rgba(var(--color-primary-rgb), 0.55) !important;\" src=\"https://www.sahebansari.com/media/posts/2/step0005.png\" alt=\"TLS 1.2\" width=\"293\" height=\"173\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://www.sahebansari.com/media/posts/2/responsive/step0005-xs.png 640w ,https://www.sahebansari.com/media/posts/2/responsive/step0005-sm.png 768w ,https://www.sahebansari.com/media/posts/2/responsive/step0005-md.png 1024w ,https://www.sahebansari.com/media/posts/2/responsive/step0005-lg.png 1366w ,https://www.sahebansari.com/media/posts/2/responsive/step0005-xl.png 1600w ,https://www.sahebansari.com/media/posts/2/responsive/step0005-2xl.png 1920w\"></figure><br><strong>Forcing a secure website and web API to use TLS 1.2</strong><br>With the recent upgrade of TLS 1.0 and 1.1 to TLS 1.2. Older TLS 1.0 and TLS 1.1 being deprecated, So, you have to force your websites/services to run over TLS 1.2.<br>You will get below error due to TLS upgrade, the latest browsers by default will make a call to service (API) using TLS1.2  and API will not accept the request with new TLS version. So to fix this issue you have to force API to accept the request with new TLS 1.2 version.<br><br><i>GET - An unhandled exception occurred. System.InvalidOperationException: An error occurred while processing this request. ---&gt; Microsoft.OData.Client.DataServiceTransportException: The underlying connection was closed: An unexpected error occurred on a send. ---&gt; System.Net.WebException: The underlying connection was closed: An unexpected error occurred on a send. ---&gt; System.IO.IOException: Unable to read data from the transport connection: An existing connection was forcibly closed by the remote host. ---&gt; System.Net.Sockets.SocketException: An existing connection was forcibly closed by the remote host</i><br><i><br></i><strong>To fix this issue you have to add below lines to global.asax</strong></p>\n<pre class=\"language-csharp line-numbers\"><code>protected void Application_Start()  \n{  \n     ServicePointManager.SecurityProtocol = SecurityProtocolType.Tls \n                | SecurityProtocolType.Tls11 \n                | SecurityProtocolType.Tls12;  \n}  </code></pre>",
            "image": "https://www.sahebansari.com/media/posts/2/step0005-2.png",
            "author": {
                "name": "Saheb Ansari"
            },
            "tags": [
                   "Technology"
            ],
            "date_published": "2024-11-09T11:52:54+05:30",
            "date_modified": "2024-11-10T11:26:00+05:30"
        }
    ]
}
